#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main() {
	/* 
	* 이중 반복문을 이용하여 아래와 같이 출력하세요
	*  *****		k=1	*=5
	*  *****		k=2	*=5
	*  *****		k=3	*=5
	*  *****		k=4	*=5
	*  *****		k=5	*=5
	*/
	int i, k;
	for (k = 1; k <= 5; k++) {
		for (i = 1; i <= 5; i++) {
			printf("*");
		}
		printf("\n");
	}
	/* 
	*  *			k=1	*=1
	*  **		k=2	*=2
	*  ***		k=3	*=3
	*  ****		k=4	*=4
	*  *****		k=5	*=5
	*				*=k
	*/
	for (k = 1; k <= 5; k++) {
		for (i = 1; i <= k; i++) {
			printf("*");
		}
		printf("\n");
	}
	/* 
	*      *		k=1	공=4		*=1
	*     **		k=2	공=3		*=2
	*    ***		k=3	공=2		*=3
	*   ****		k=4	공=1		*=4
	*  *****		k=5	공=0		*=5
	*				공=5-k	*=k
	*/
	for (k = 1; k <= 5; k++) {
		for (i = 1; i <= 5-k ; i++) {
			printf(" ");
		}
		for (i = 1; i <= k; i++) {
			printf("*");
		}
		printf("\n");
	}
	/* 
	*     *
	*    ***
	*   *****
	*  *******
	* *********
	*/
	return 0;
}