#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>
#include <time.h>

int main() {
	/* 숫자 야구 게임 
	* - 1~9사이의 중복되지 않은 세수를 랜덤으로 생성
	* - 사용자가 생성된 랜덤한 수를 맞추는 게임(순서도 일치) 
	* - S(스트라이크) : 해당 숫자가 있고, 자리수가 일치
	* - B(볼) : 해당 숫자가 있고, 자리수가 불일치
	* - 3O : 일치하는 숫자가 하나도 없는 경우
	* - 3S : 모든 숫자와 자리수가 일치하는 경우
	* - 예  
	*   랜덤한 수 : 1 7 5 
	*   입력 : 1 2 3 
	*   출력 : 1S
	*   입력 : 1 5 6 
	*   출력 : 1S 1B
	*   입력 : 4 9 8
	*   출력 : 3O 
	*   입력 : 1 7 5
	*   출력 : 3S
	*   정답입니다.
	*/
	
	return 0;
}