#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main() {
	/*
	* *****	i=1, *=5
	* ***** i=2, *=5
	* ***** i=3, *=5
	* ***** i=4, *=5
	* ***** i=5, *=5
	*/
	int i, j;
	for (i = 1; i <= 5; i++) {
		for (j = 1; j <= 5; j++) {
			printf("*");
		}
		printf("\n");
	}
	/*
	* *		i=1, *=1
	* **	i=2, *=2
	* ***	i=3, *=3
	* ****	i=4, *=4
	* *****	i=5, *=5
	*			 *=i
	*/
	for (i = 1; i <= 5; i++) {
		for (j = 1; j <= i; j++) {
			printf("*");
		}
		printf("\n");
	}
	/*
	*     *	i=1, 공=4,*=1
	*    **	i=2, 공=3,*=2
	*   ***	i=3, 공=2,*=3
	*  ****	i=4, 공=1,*=4
	* *****	i=5, 공=0,*=5
	*			 공=5-i ,*=i
	*/
	for (i = 1; i <= 5; i++) {
		//공백 출력
		for (j = 1; j <= 5 - i; j++) {
			printf(" ");
		}
		//* 출력
		for (j = 1; j <= i; j++) {
			printf("*");
		}
		//엔터
		printf("\n");
	}
	/*
	*     *
	*    ***
	*   *****
	*  *******
	* *********
	*/
	return 0;
}